src/DataProcessors/ПечатьКарточекДляКанбанов/ПечатьКарточекДляКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьКарточекДляКанбанов</name>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаКанбанов</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХраненияПотребитель</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Канбан</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЯчеек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ПараметрыИзделийУЛИШИ/ПараметрыИзделийУЛИШИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыИзделийУЛИШИ</name>
  <resources>
    <name>ВидТары</name>
    <type>
      <types>CatalogRef.ВидыТары</types>
    </type>
  </resources>
  <resources>
    <name>Прессформа</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </resources>
  <resources>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.ЦветаИзделий</types>
    </type>
  </resources>
  <resources>
    <name>БазоваяОтливка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВидыКанбанов/ВидыКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКанбанов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Время</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриЗаменеСоздаватьМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноПеремещениеВБрак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьВПроизводстве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаскрыватьСпецификациюПриРемонте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСписанияНедостачи</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПриходаИзлишков</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДляСебестоимости</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СканироватьПриИспользовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МестаХранения</name>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПечатьКарточекДляКанбанов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПечатьКарточекУЛИШИНаСервере(КоличествоКопийЗадано)
ТабДок.Очистить();
barcode = ПолучитьCOMОбъект("","STROKESCRIBE.StrokeScribeClass.1");
barcode.Alphabet=25; //QRCODE
Макет = ПолучитьОбщийМакет("QRКодКанбанУЛИШИ");
ОблQRКод = Макет.ПолучитьОбласть("QRКод|Секция");
МаксКолНаЛисте = 5;
Четный = Ложь;
	Для каждого ТЧ Из Объект.ТаблицаКанбанов Цикл
		Если ТЧ.Пометка Тогда
			Если КоличествоКопийЗадано > 0 Тогда
			КоличествоКопий = КоличествоКопийЗадано;
			Иначе
			КоличествоКопий = ТЧ.КоличествоЯчеек;
			КонецЕсли; 
				Для к = 1 По КоличествоКопий Цикл
				QRCode = ЗначениеВСтрокуВнутр(ТЧ.МестоХраненияПотребитель)+";"+ЗначениеВСтрокуВнутр(ТЧ.Канбан)+";"+ТЧ.Количество;
				ИмяФайла=ПолучитьИмяВременногоФайла("wmf");
				barcode.Text=QRCode;
				barcode.UTF8=1;
				barcode.QrECL=2;
				код=barcode.SavePicture(ИмяФайла,7,100,100);          
					Если код <> 0 Тогда //Проверка результата генерации штрихкода
					Сообщить(строка(код) + " - " + barcode.ErrorDescription);
					Возврат;
					КонецЕсли;
				рис=ОблQRКод.Рисунки.QRCode;
				рис.РазмерКартинки=РазмерКартинки.Пропорционально;
				рис.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				рис.Картинка = Новый Картинка(ИмяФайла);
				НомерДетали = СокрЛП(Лев(ТЧ.Канбан.Наименование,Найти(ТЧ.Канбан.Наименование,"(")-1));
					Пока Найти(НомерДетали,".") > 1 Цикл
					НомерДетали = Сред(НомерДетали,Найти(НомерДетали,".")+1);	
					КонецЦикла;
				ОблQRКод.Параметры.НомерДетали = НомерДетали;
				ОблQRКод.Параметры.Наименование = СокрЛП(ТЧ.Канбан.Наименование);
				ОблQRКод.Параметры.Количество = ТЧ.Количество;
				ПараметрыИзделийУЛИШИ = РегистрыСведений.ПараметрыИзделийУЛИШИ.Выбрать(Новый Структура("Номенклатура",ТЧ.Канбан));
					Пока ПараметрыИзделийУЛИШИ.Следующий() Цикл
					ОблQRКод.Параметры.ВидТары = ПараметрыИзделийУЛИШИ.ВидТары;
					НомерБО = ПараметрыИзделийУЛИШИ.БазоваяОтливка;
						Пока Найти(НомерБО,".") > 1 Цикл
						НомерБО = Сред(НомерБО,Найти(НомерБО,".")+1);	
						КонецЦикла;
					ОблQRКод.Параметры.НомерБО = НомерБО;
					ОблQRКод.Параметры.Прессформа = ПараметрыИзделийУЛИШИ.Прессформа;				
					КонецЦикла; 
						Если Не Четный Тогда
						ТабДок.Вывести(ОблQRКод);
						Четный = Истина;
						Иначе	
						ТабДок.Присоединить(ОблQRКод);
						Четный = Ложь;
						МаксКолНаЛисте = МаксКолНаЛисте - 1;
						КонецЕсли; 
							Если МаксКолНаЛисте = 0 Тогда
							ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
							МаксКолНаЛисте = 5;				
							КонецЕсли;  
				УдалитьФайлы(ИмяФайла);
				КонецЦикла;
		КонецЕсли; 
	КонецЦикла; 
ТабДок.РазмерСтраницы = "A4";
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКарточекУЛИШИ(Команда)
КоличествоКопий = 0;
	Если ВвестиЧисло(КоличествоКопий,"Введите кол-во копий (если 0, то по кол-ву ячеек из таблицы)",1,0) Тогда
	ПечатьКарточекУЛИШИНаСервере(КоличествоКопий);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзГруппыНаСервере(ВыбГруппа)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	|	И Номенклатура.Канбан <> &ПустойКанбан"; 
Запрос.УстановитьПараметр("ГруппаНоменклатуры", ВыбГруппа);
Запрос.УстановитьПараметр("ПустойКанбан", Справочники.ВидыКанбанов.ПустаяСсылка());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = Объект.ТаблицаКанбанов.Добавить();
	ТЧ.Канбан = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ.КоличествоЯчеек = ВыборкаДетальныеЗаписи.Ссылка.КолКанбан;
	ТЧ.Количество = ВыборкаДетальныеЗаписи.Ссылка.КолВКанбане;
	КонецЦикла;
Объект.ТаблицаКанбанов.Сортировать("Канбан");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзГруппы(Команда)
	Если Объект.ТаблицаКанбанов.Количество() > 0 Тогда
		Если Вопрос("Таблица канбанов не пустая! Очистить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.ТаблицаКанбанов.Очистить();
		КонецЕсли;
	КонецЕсли; 
ВыбГруппа = Неопределено;
Результат = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбораГруппы");
	Если Результат <> Неопределено Тогда
	ДобавитьИзГруппыНаСервере(Результат);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоВидамКанбановНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Канбан В ИЕРАРХИИ(&СписокВидовКанбанов)";
Запрос.УстановитьПараметр("СписокВидовКанбанов", СписокВидовКанбанов);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = Объект.ТаблицаКанбанов.Добавить();
	ТЧ.Канбан = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ.КоличествоЯчеек = ВыборкаДетальныеЗаписи.Ссылка.КолКанбан;
	ТЧ.Количество = ВыборкаДетальныеЗаписи.Ссылка.КолВКанбане;
	КонецЦикла;
Объект.ТаблицаКанбанов.Сортировать("Канбан");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоВидамКанбанов(Команда)
	Если Объект.ТаблицаКанбанов.Количество() > 0 Тогда
		Если Вопрос("Таблица канбанов не пустая! Очистить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.ТаблицаКанбанов.Очистить();
		КонецЕсли;
	КонецЕсли;
ДобавитьПоВидамКанбановНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из Объект.ТаблицаКанбанов Цикл		
	ТЧ.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из Объект.ТаблицаКанбанов Цикл		
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НазначитьВыбраннымНаСервере()
	Для каждого ТЧ Из Объект.ТаблицаКанбанов Цикл
		Если ТЧ.Пометка Тогда
		ТЧ.МестоХраненияПотребитель = Объект.МестоХраненияПотребитель;
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВыбранным(Команда)
НазначитьВыбраннымНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНоменклатуры(Наименование,МестоХранения,Количество)
Спецификация = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не Спецификация.Пустая() Тогда
	ТЧ = Объект.ТаблицаКанбанов.Добавить();
	ТЧ.Пометка = Истина;
	ТЧ.МестоХраненияПотребитель = МестоХранения;
	ТЧ.Канбан = Спецификация;
	ТЧ.КоличествоЯчеек = Спецификация.КолКанбан;	
	ТЧ.Количество = Количество;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМестоХранения(Наименование)
Возврат(Справочники.МестаХранения.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c данными по канбанам минитипографии");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка данными по канбанам минитипографии из файла..."); 
		Наименование = СокрЛП(ExcelЛист.Cells(к,1).Value);
		МестоХранения = ПолучитьМестоХранения(СокрЛП(ExcelЛист.Cells(к,3).Value));
			Если Не МестоХранения.Пустая() Тогда
			ДобавитьСтрокуНоменклатуры(Наименование,МестоХранения,Число(ExcelЛист.Cells(к,2).Value));
			Иначе
			Сообщить("Место хранения "+СокрЛП(ExcelЛист.Cells(к, 2).Value)+" не найдено!");
			КонецЕсли;
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
